app/controllers/sessions_controller.rb

def login
    # @session = Session.find(params[:ID])
    @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "selena"], ["LIMIT", 1]]