app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "avada ngoc"], ["password", "123"], ["token", "CVuLB9PFqe62gq1emit0Bw=="], ["created_at", "2018-06-05 04:09:23.699851"], ["updated_at", "2018-06-05 04:09:23.699851"]]