app/models/user.rb

  def generate_u_token
    begin
    new_u_token = SecureRandom.base64
  end while User.find_by(token: new_u_token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "EdXiRJdMk7LswXifowgIRg=="], ["LIMIT", 1]]